select "Н_ГРУППЫ_ПЛАНОВ"."ГРУППА",
       "Н_УЧЕНИКИ"."ИД",
       "Н_ЛЮДИ"."ФАМИЛИЯ",
       "Н_ЛЮДИ"."ИМЯ",
       "Н_ЛЮДИ"."ОТЧЕСТВО",
       "Н_УЧЕНИКИ"."П_ПРКОК_ИД",
       "Н_УЧЕНИКИ"."СОСТОЯНИЕ" as "Состояние пункта приказа"
from "Н_УЧЕНИКИ"
         join
     "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         join
     "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         join
     "Н_ГРУППЫ_ПЛАНОВ" ON "Н_УЧЕНИКИ"."ГРУППА" = "Н_ГРУППЫ_ПЛАНОВ"."ГРУППА"
         join
     "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_УЧЕНИКИ"."ВИД_ОБУЧ_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
         join
     "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ" on "Н_ПЛАНЫ"."НАПС_ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."ИД"
         join
     "Н_НАПР_СПЕЦ" on "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НС_ИД" = "Н_НАПР_СПЕЦ"."ИД"
where "Н_УЧЕНИКИ"."НАЧАЛО" = '2010-09-01'
  and "Н_ПЛАНЫ"."КУРС" = '1'
  and "Н_УЧЕНИКИ"."ПРИЗНАК" = 'обучен'
  and "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
  and "Н_НАПР_СПЕЦ"."КОД_НАПРСПЕЦ" = '230101';
