select count(*) AS "Хорошисты группы 3100"
from (select "Н_УЧЕНИКИ"."ИД"
      from "Н_УЧЕНИКИ"
               join
           "Н_ВЕДОМОСТИ" on "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
               and "Н_ВЕДОМОСТИ"."ОЦЕНКА" not in ('осв', 'неявка', 'зачет', 'незач')
      where "Н_УЧЕНИКИ"."ГРУППА" = '3100'
        and "Н_УЧЕНИКИ"."ЧЛВК_ИД" not in (
                select "ЧЛВК_ИД" from "Н_ВЕДОМОСТИ" where "ОЦЕНКА" = 'незач')
      group by "Н_УЧЕНИКИ"."ИД"
      having (4.5 > avg(cast("Н_ВЕДОМОСТИ"."ОЦЕНКА" as INT)))
         and 3.5 < avg(cast("Н_ВЕДОМОСТИ"."ОЦЕНКА" as INT))) as avg_mark;
